Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/the_irish_government/index.html.txt.tmx
Source language: en
Languages: ga

source: This document introduces the Government of Ireland
ga: Tá eolas ar fáil anseo faoin Rialtas

source: Government and Dáil Éireann
ga: An Rialtas agus Dáil Éireann

source: The Government and Dáil Éireann (the lower house of the Irish parliament) have a close relationship
ga: Tá caidreamh dlúth idir an Rialtas agus Dáil Éireann (teach íochtair na parlaiminte Éireannaigh)

source: Description and explanation of this relationship
ga: Cur síos agus míniú faoin gcaidreamh seo

source: The Taoiseach is the head of Government
ga: Tá an Taoiseach i gceannas ar an Rialtas

source: Role and responsibilities of the Taoiseach are discussed
ga: Déantar cuir síos anseo ar ról agus freagrachtaí an Taoisigh

source: The Tanaiste is the deputy Taoiseach.He or she acts in place of the Taoiseach if the Taoiseach is abroad or ill
ga: Déantar cuir síos anseo ar ról an Táiniste sa Rialtas

source: The Attorney General is the legal adviser to the Irish Government
ga: Déantar cuir síos anseo ar an Ard Aighne agus ar an ról atá acu

source: The Government Chief Whip is responsible for organising and co-ordinating Government business in Dáil Éireann (the lower house of the Irish parliament)
ga: Tá Príomhaoire an Rialtais freagrach as eagrú agus comhordú a dhéanamh ar ghnóthaí an Rialtais i nDáil Éireann (teach íochtair na parlaiminte Éireannaigh)

source: This document describes the circumstances in which a coalition government can be set up and how it functions
ga: Déantar cuir síos anseo ar na fáthanna a gcuirtear comhrialtas le chéile agus conas mar a oibríonn sé

source: The Irish constitution sets out the membership of the Government
ga: Leagann Bunreacht na hÉireann síos ballraíocht na Rialtais

source: Explanation of these members and links to current Ministers
ga: Míniú na baill seo agus naisc le hAirí reatha

source: Most Read in "Government in Ireland"
ga: Ábhar is mó éilimh i "Rialtas in Éirinn"

source: Fundamental Rights under the Irish Constitution
ga: Bunchearta faoi Bhunreacht na hÉireann
